Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_176-Vimalakirtinirdesa-v1.tmx
Source language: bo
Languages: en

source: རིགས་ཀྱི་བུ་འཇིག་ཚོགས་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་རིགས་སོ། །མ་རིག་པ་དང་། སྲིད་པའི་སྲེད་པ་ནི་རིགས་སོ། །འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་ནི་རིགས་སོ། །ཕྱིན་ཅི་ལོག་བཞི་ནི་རིགས་སོ། །སྒྲིབ་པ་ལྔ་ནི་རིགས་སོ། །སྐྱེ་མཆེད་དྲུག་ནི་རིགས་སོ། །རྣམ་པར་ཤེས་པ་ལ་གནས་པ་བདུན་ནི་རིགས་སོ། །ལོག་པ་བརྒྱད་ནི་རིགས་སོ། །ཀུན་ནས་མནར་སེམས་ཀྱི་དངོས་པོ་དགུ་ནི་རིགས་སོ། །མི་དགེ་བའི་ལས་ཀྱི་ལམ་བཅུ་ནི་རིགས་སོ།
en: Noble sir, the family of the tathāgatas consists of all basic egoism; of ignorance and the thirst for existence; of lust, hate, and folly; of the four misapprehensions; of the five obscurations; of the six sense-media; of the seven abodes of consciousness; of the eight perverse paths; of the nine causes of irritation; and of the paths of the ten sins. Such is the family of the tathāgatas.

source: འཇམ་དཔལ་ཅི་ལས་བསམས་ཏེ་དེ་སྐད་སྨྲ།
en: Mañjuśrī, with what in mind do you say so?

source: རིགས་ཀྱི་བུ་འདུས་མ་བྱས་མཐོང་བ་ངེས་པར་འཇུག་པ་ལ་གནས་པས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་མི་ནུས་སོ།
en: Noble sir, one who stays in the fixed determination of the vision of the uncreated is not capable of conceiving the spirit of unexcelled perfect enlightenment.

source: །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན་དགོན་དུང་གིས་ཕྱོགས་སུ་མེ་ཏོག་ཨུཏྤལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་དང་དྲི་མཆོག་རྣམས་མི་སྐྱེ་སྟེ།
en: Noble sir, flowers like the blue lotus, the red lotus, the white lotus, the water lily, and the moon lily do not grow on the dry ground in the wilderness,

source: འདམ་དང་ཆུ་གླིང་དུ་བསྐྱེད་ན་
en: but do grow in the swamps and mud banks.

source: མཚམས་མེད་པ་ལྔ་དང་ལྡན་པས་ནི་བྱང་ཆུབ་ཀྱི་སེམས་བསྐྱེད་པར་ཡང་ནུས། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་ནུས་སོ།
en: Only those guilty of the five deadly sins can conceive the spirit of enlightenment and can attain buddhahood, which is the full accomplishment of the qualities of the Buddha!

source: སོ་སོའི་སྐྱེ་བོས་ནི་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་ཐོས་པས་དཀོན་མཆོག་གསུམ་གྱི་གདུང་རྒྱུན་མི་འཆད་པར་བྱ་བའི་ཕྱིར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པར་བྱེད་ལ།
en: Ordinary individuals, upon learning of the virtues of the Buddha, conceive the spirit of unexcelled perfect enlightenment, in order to ensure the uninterrupted continuity of the heritage of the Three Jewels;

source: ཇི་ལྟར་སེམས་ཅན་ཕན་པར་ཡང་། །སངས་རྒྱས་ཞིང་རྣམས་སྤྱོད་མོད་ཀྱི། །ནམ་མཁའ་ལྟ་བུར་ཞིང་རྣམས་གྱུར། །སེམས་ཅན་སེམས་ཅན་འདུ་ཤེས་མེད།
en: They journey through all buddhafields In order to bring benefit to living beings, Yet they see those fields as just like empty space, Free of any conceptual notions of ‘living beings.’

source: །སེམས་ཅན་ཀུན་གྱི་གཟུགས་རྣམས་དང་། །སྒྲ་སྐད་གང་རྣམས་འབྱིན་པ་དང་། །འཇིགས་མེད་བྱང་ཆུབ་སེམས་དཔའ་རྣམས། །སྐད་ཅིག་གཅིག་གིས་སྟོན་པར་བྱེད།
en: The fearless bodhisattvas can manifest, All in a single instant, The forms, sounds, and manners of behavior Of all living beings.

source: །སེམས་ཅན་བྱེ་བ་སྟོང་རྣམས་ཀྱང་། །ཡུལ་གཅིག་ཏུ་ནི་མགྲོན་དུ་གཉེར།
en: Invited by hundreds of thousands of living beings, All in the same country,

source: །སྔགས་དང་རིག་པ་ཅི་ཡོད་དང་། ། བཟོ་གནས་རྣམ་པ་མང་པོ་དག །ཐམས་ཅད་ཀྱི་ཡང་ཕ་རོལ་ཕྱིན།
en: They excel in all esoteric sciences, And in the many different crafts,

source: །སེམས་ཅན་ཐམས་ཅད་བདེ་ཐོབ་བྱེད།
en: And they bring forth the happiness Of all living beings.

source: །གཡུལ་ཆེན་འདྲེན་པའི་ནང་དུ་ནི། །དེ་དག་ཕྱོགས་ལ་མཉམ་པར་འགྱུར།
en: In the middle of great battles They remain impartial to both sides;

source: །བྱང་ཆུབ་སེམས་དཔའ་སྟོབས་ཆེན་རྣམས། །འདུམ་ཞིང་འདུ་བར་དགའ་བར་བྱེད།
en: For bodhisattvas of great strength Delight in reconciliation of conflict.

source: །བསམས་བཞིན་སྨད་འཚོང་རྣམས་སུ་སྒྱུར། །སྐྱེས་པ་རྣམས་ནི་བསྡུ་བའི་ཕྱིར།
en: They intentionally become courtesans In order to win men over,

source: འདོད་ཆགས་ལྕགས་ཀྱུས་བརྗོད་ནས་སུ། །དེ་དག་སངས་རྒྱས་ཡེ་ཤེས་འགོད།
en: And, having caught them with the hook of desire, They establish them in the buddha.

source: །ང་རྒྱལ་ཁེངས་པའི་སེམས་ཅན་ལ། །དེ་དག་ཚན་ཆེན་མཆོག་གྱུར་ཏེ།
en: They become invincible champions For the sake of the proud and the vain,

source: །ང་རྒྱལ་ཀུན་ཀྱང་བཅོམ་ནས་སུ། །བླ་མེད་བྱང་ཆུབ་ཚོལ་དུ་བཙུད།
en: And, having conquered all their pride, They start them on the quest for enlightenment.

source: །འཇིགས་སྐྲག་སེམས་ཅན་རྣམས་ལ་ནི། །རྟག་ཏུ་དེ་ཡི་མདུན་ན་འདུག
en: They always stand at the head Of those terrified with fright,

source: །དེ་དག་མི་འཇིགས་བྱིན་ནས་ཀྱང་། ། བྱང་ཆུབ་ཏུ་ནི་སྨིན་པར་བྱེད།
en: And, having bestowed fearlessness upon them, They develop them toward enlightenment.

source: །གང་རྣམས་ཤེས་རབ་མེད་པ་ཡི། །སེམས་ཅན་དམན་པ་མ་གཏོགས་པར།
en: Except for some inferior living beings, Without any intelligence at all,

source: །མཁས་པས་ཆོས་འདི་ཐོས་གྱུར་ནས། །བྱང་ཆུབ་མཆོག་ལ་སུ་མི་སྨོན།
en: Is there anyone with any discernment Who, having heard this teaching, Would not wish for the supreme enlightenment?

source: །།དེ་ནས་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then, the Licchavi Vimalakīrti asked those bodhisattvas,

source: །སྐྱེས་བུ་དམ་པ་དག་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གཉིས་སུ་མེད་པའི་ཆོས་ཀྱི་སྒོར་འཇུག་པ་གང་ཡིན།
en: Good sirs, please explain how the bodhisattvas enter the Dharma-door of nonduality!

source: །བྱང་ཆུབ་སེམས་དཔའ་དཔལ་སྦས་ཀྱིས་སྨྲས་པ།
en: The bodhisattva Śrīkūṭa declared,

source: ང་དང་ང་འོ་ཞེས་བྱ་བ་དེ་ནི་གཉིས་ཏེ།
en: ‘I’ and ‘mine’ are two.

source: ཀུན་ནས་ཉོན་མོངས་པ་ཡོངས་སུ་ཤེས་ནས་རྣམ་པར་བྱང་བ་ལ་རློམ་སེམས་སུ་མི་འགྱུར་ཞིང་
en: When there is thorough knowledge of defilement, there will be no conceit about purification.

source: རློམ་སེམས་ཐམས་ཅད་ལེགས་པར་འཇོམས་པ་དང་། འཐུན་པར་འགྲོ་བའི་ལམ་དེ་ནི་གཉིས་སུ་མེད་པ་ལ་འཇུག་པའོ།
en: The path leading to the complete conquest of all conceit is the entrance into nonduality.

source: །གང་རྟོག་པར་མི་བྱེད། ཀུན་ཏུ་རྟོག་པར་མི་བྱེད། མཚན་ཉིད་གཅིག་པར་མི་བྱེད། མཚན་ཉིད་མེད་པར་མི་བྱེད་དོ། །གང་མཚན་ཉིད་དང་མཚན་ཉིད་མི་འདྲ་བ་ལ་མཚན་ཉིད་མཚུངས་པར་འཇུག་པ་དེ་ནི་གཉིས་སུ་མེད་པར་འཇུག་པའོ།
en: Not to presume or construct something is neither to establish its uniqueness nor to establish its characterlessness. To penetrate the equality of these two is to enter nonduality.

source: མཉམ་པ་ཉིད་ལ་མཉམ་པ་ཉིད་ཐོབ་པའང་མེད་ཅིང་འདུ་ཤེས་ཀྱི་མདུད་པ་མེད་པ་
en: has equanimity without any attainment of equanimity—he enters the absence of conceptual knots.

source: དེ་ལྟར་གང་འཇུག་པ་དེ་ནི་གཉིས་སུ་མེད་པར་འཇུག་པའོ།
en: Thus, he enters into nonduality.

source: །བྱང་ཆུབ་སེམས་དཔའ་བདེ་མོས་ཀྱིས་སྨྲས་པ།
en: The bodhisattva Sukhādhimukta declared,

source: འདི་ནི་བདེ་བ། འདི་ནི་མི་བདེ་བའོ་ཞེས་བྱ་བ་དེ་ནི་གཉིས་ཏེ།
en: To say, ‘this is happiness’ and ‘that is misery’ is dualism.

source: འདི་ནི་འཇིག་རྟེན་པའོ། །འདི་ནི་འཇིག་རྟེན་ལས་འདས་པའོ་ཞེས་བྱ་བ་དེ་ནི་གཉིས་ཏེ།
en: To say, ‘this is mundane’ and ‘that is transcendental’ is dualism.

source: གང་ལ་མི་རྒལ། མི་འཇུག །འགྲོ་བའང་མེད། མི་འགྲོ་བའང་མེད་པ་
en: Thus, neither to transcend nor to be involved, neither to go nor to stop—

source: དེ་ནི་གཉིས་སུ་མེད་པར་འཇུག་པའོ།
en: this is the entrance into nonduality.

source: གང་མིག་ཡོངས་སུ་ཤེས་པས་གཟུགས་ལ་མི་ཆགས། མི་སྡང་མི་རྨོངས་པ་དེ་ནི་ཞི་བ་ཞེས་བྱའོ།
en: To understand the eye correctly, and not to have attachment, aversion, or confusion with regard to form—that is called ‘peace.’

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འཇིག་ཚོགས་སུ་ལྟ་བ་མི་སྐྱེ་བ་མེད་ཅིང་གང་ལྟ་བ་དེས་འཇིག་ཚོགས་སོ་ཞེའམ། འཇིག་ཚོགས་འགོག་ཅེས་མི་རྟོག་སྟེ།
en: The egoistic views of aggregates, being unproduced themselves, do not exist ultimately. Hence such views do not really conceptualize ‘these are aggregates’ or ‘these aggregates cease.’

source: དེ་མི་རྟོག །རྣམ་པར་མི་རྟོག །ཤིན་ཏུ་མི་རྟོག་པས་འགོག་པའི་རང་བཞིན་དུ་གྱུར་ཏེ།
en: Ultimately, they have no such discriminative constructions and no such conceptualizations. Therefore, such views have themselves the nature of cessation.

source: ཆོས་འདི་དག་ནི་མངོན་པར་འདུ་མི་བྱེད་པའི་མཚན་ཉིད་དེ།
en: These things have the nature of inactivity.

source: ཤེས་པ་དེ་ནི་གཉིས་སུ་མེད་པར་འཇུག་པའོ།
en: for this knowledge is the entrance into nonduality.

source: གང་བསོད་ནམས་དང་བསོད་ནམས་མ་ཡིན་པ་དང་། མི་གཡོ་བ་མངོན་པར་འདུ་མི་བྱེད་པ་དེ་ནི་གཉིས་སུ་མེད་པའོ།
en: The non-undertaking of meritorious, sinful, and unmoving actions is not dualistic.

source: །བསོད་ནམས་དང་། བསོད་ནམས་མ་ཡིན་པ་དང་། མི་གཡོ་བའི་འདུ་བྱེད་རྣམས་ཀྱི་རང་གི་མཚན་ཉིད་སྟོང་པ་སྟེ།
en: The intrinsic nature of all such actions is voidness,

source: དེ་ལ་བསོད་ནམས་ཀྱང་མེད། བསོད་ནམས་མ་ཡིན་པ་ཡང་མེད། མི་གཡོ་བ་ཡང་མེད། མངོན་པར་འདུ་བྱེད་པའང་མེད་དེ།
en: wherein ultimately there is neither merit, nor sin, nor non-movement, nor action itself.

source: འདི་ལྟར་འགོག་པར་སྙོམས་པར་ཞུགས་པ་ལ་མུན་པ་ཡང་མེད། སྣང་བ་ཡང་མེད་དེ།
en: At the time of absorption in cessation, there is neither darkness nor light,

source: གང་བཅིངས་པ་ལས་ནི་གྲོལ་བར་བསྟན་གྱི།
en: Liberation can be found where there is bondage,

source: །མི་སྤྱོད་པ་ལ་གནས་པ་ནི་ལམ་གྱི་འདུ་ཤེས་སམ། ལམ་མ་ཡིན་པའི་འདུ་ཤེས་སུ་མི་འགྱུར་རོ།
en: Living in such unconcern, he entertains no concepts of ‘path’ or ‘nonpath.’

source: །འདུ་ཤེས་ཡོངས་སུ་རིག་པ་ནི་བློ་གཉིས་སུ་མི་འཇུག་སྟེ། དེ་ནི་གཉིས་སུ་མེད་པར་འཇུག་པའོ།
en: Understanding the nature of concepts, his mind does not engage in duality. Such is the entrance into nonduality.

source: ཤའི་མིག་གིས་མི་མཐོང་གི་ཤེས་རབ་ཀྱི་མིག་གིས་མཐོང་སྟེ།
en: One does not see with the physical eye, one sees with the eye of wisdom.

source: ཇི་ལྟར་མི་མཐོང་ན་རྣམ་པར་མི་མཐོང་བ་དེ་ལྟར་མཐོང་ངོ་། །གང་ལ་མཐོང་བ་ཡང་མེད། རྣམ་པར་མཐོང་བ་ཡང་མེད་པ་དེ་ནི་གཉིས་སུ་མེད་པར་འཇུག་པའོ།
en: And with the wisdom-eye one sees only insofar as there is neither sight nor nonsight. There, where there is neither sight nor nonsight, is the entrance into nonduality.

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: The crown prince Mañjuśrī applauded the Licchavi Vimalakīrti:

source: ལེགས་སོ་ལེགས་སོ། །རིགས་ཀྱི་བུ་
en: Excellent! Excellent, noble sir!

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གཉིས་སུ་མེད་པར་འཇུག་པ་ཡིན་ཏེ།
en: This is indeed the entrance into the nonduality of the bodhisattvas.

source: །འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་ཁང་པ་བརྩེགས་པ་ཐམས་ཅད་ཀྱང་
en: In that universe, all the houses,

source: འཆག་ས་དང་། སྐྱེད་མོས་ཚལ་དང་། གཞལ་མེད་ཁང་ཐམས་ཅད་ཀྱང་སྤོས་ལས་བྱས་སོ།
en: the avenues, the parks, and the palaces are made of various perfumes,

source: །དེའི་ཚེ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤོས་མཆོག་བརྩེགས་པ་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་ཐབས་ཅིག་ཏུ་བཤོས་གསོལ་བའི་ཕྱིར་ཞུགས་ཏེ།
en: At this time, the Tathāgata Gandhottama­kūṭa sat down with his bodhisattvas to take his meal,

source: དེ་ན་ལྷའི་བུ་སྤོས་བཀོད་པའི་ཟས་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་དེ་བཅོམ་ལྡན་འདས་དང་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གི་རིམ་གྲོ་དང་བསྙེན་བཀུར་བྱེད་པར་བརྩོན་ནོ།
en: and the deities called Gandha­vyūhāhāra, who were all devoted to the Mahāyāna, served and attended upon that Buddha and his bodhisattvas.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་སྤོས་མཆོག་བརྩེགས་པ་ཞེས་བྱ་བ་ད་ལྟར་བཤོས་གསོལ་བའི་ཕྱིར་བཞུགས་པ་
en: where you will find the Tathāgata Gandhottama­kūṭa taking his meal.

source: །ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ལན་བརྒྱ་སྟོང་དུ་མགོ་བོས་ཕྱག་འཚལ་ནས་
en: ‘The Licchavi Vimalakīrti bows down one hundred thousand times at your feet, O Lord,

source: བཅོམ་ལྡན་འདས་ལ་གནོད་པ་ཆུང་ངམ། ཉམ་ང་བ་ཉུང་ངམ། བསྐྱོད་པ་ཡང་ངམ། འཚོ་འམ། སྟོབས་དང་། བདེ་བ་དང་། ཁ་ན་མ་ཐོ་བ་མི་མངའ་ཞིང་བདེ་བར་རེག་པ་ལ་གནས་སམ་ཞེས་སྙུན་གསོལ་ཞིང་འདི་སྐད་ཅེས་ཀྱང་མཆིའོ།
en: and asks after your health—if you have but little trouble, little discomfort, little unrest; if you are strong, well, without complaint, and living in touch with supreme happiness.’

source: །བཅོམ་ལྡན་འདས་ཀྱིས་གསོལ་བའི་ཕམ་ཕབས་བདག་ལ་སྩལ་བར་གསོལ།
en: Vimalakīrti asks the Lord to give me the remains of your meal,

source: །དམན་པ་ལ་མོས་པའི་སེམས་ཅན་འདི་དག་ཀྱང་སངས་རྒྱས་ཀྱི་ཆོས་རྒྱ་ཆེན་པོ་ལ་བློ་གྲོས་མོས་པར་བགྱིད་ཅིང་
en: Then, those living beings who aspire to inferior ways may gain the intelligence to aspire to the great Dharma of the Buddha, and

source: སངས་རྒྱས་ཀྱི་མཚན་ཀྱང་རྒྱས་པར་བགྱིད་པར་འགྱུར་རོ་ཞེས་མཆིའོ།
en: the name of the Buddha will be celebrated far and wide.

source: དམན་པ་ལ་མོས་པ་ཞེས་བགྱི་བ་དེ་ཅི་ལགས་
en: What does he mean by ‘those who aspire to inferior ways’?

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་དེ་སྐད་ཅེས་ཞུས་པ་དང་།
en: Having thus been questioned by those bodhisattvas,

source: ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་དེའི་ཆེ་བ་ཇི་ཙམ་ན་དེའི་སྤྲུལ་པ་འདི་ཡང་རྫུ་འཕྲུལ་དང་། སྟོབས་དང་། མི་འཇིགས་པ་འདི་ལྟ་བུར་གྱུར།
en: How great must that bodhisattva be himself if his magical incarnation is thus endowed with supernatural power, strength, and fearlessness!

source: བཅོམ་ལྡན་འདས་དེས་བཀའ་སྩལ་པ།
en: The Tathāgata said,

source: རིགས་ཀྱི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་ནི་ནམ་མཁའི་ཞིང་སྟེ།
en: Noble sons, a buddhafield is a field of pure space,

source: སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་སངས་རྒྱས་ཀྱི་ཡུལ་ཐམས་ཅད་མི་སྟོན་ཏོ།
en: but the lord buddhas, in order to develop living beings, do not reveal all at once the pure realm of the Buddha.

source: །དེ་ནས་སྤྲུལ་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེས་ཞལ་ཟས་ཀྱིས་བཀང་བའི་སྣོད་དེ་དྲི་མ་མེད་པར་གྲགས་པ་ལ་བྱིན་ནོ།
en: Then, the incarnated bodhisattva gave the vessel full of food to Vimalakīrti,

source: དེ་ནས་ཞལ་ཟས་དེའི་དྲིས་ཡངས་པའི་གྲོང་ཁྱེར་ཆེན་པོར་འདུག་པར་གྱུར་ཏེ།
en: and the fragrance of that food permeated the entire great city of Vaiśālī

source: འཇིག་རྟེན་གྱི་ཁམས་སྟོང་གི་བར་དུ་དྲི་ཞིམ་པོ་མནམ་པར་གྱུར་ཏོ།
en: and its sweet perfume spread throughout one hundred universes.

source: གང་ཡངས་པའི་གྲོང་ཁྱེར་གྱི་བྲམ་ཟེ་དང་། ཁྱིམ་བདག་རྣམས་དང་། ལིད་ཙ་བཱི་རྣམས་ཀྱི་དབང་པོ་ལིད་ཙ་བཱི་ཟླ་གདུགས་ཀྱིས་དྲི་དེ་མནམས་ནས།
en: Within the city of Vaiśālī, the brahmins, householders, and even the Licchavi chieftain Candracchattra, having noticed this fragrance,

source: ངོ་མཚར་དུ་གྱུར་རྨད་དུ་གྱུར་ཏེ།
en: were amazed and filled with wonder.

source: དེ་དག་ཤིན་ཏུ་མོས་ཤིང་རབ་ཏུ་དགའ་བ་ཆེན་པོ་སྐྱེས་ཏེ།
en: they were filled with admiration and great joy.

source: འདི་ལྟ་སྟེ་དཔེར་ན་རྒྱ་མཚོ་ཆེན་པོ་བཞི་ནི་ཟད་ཀྱང་སྲིད་ཀྱི་ཞལ་ཟས་འདི་ལ་ཟད་པ་ཅུང་ཟད་ཀྱང་མེད་དོ།
en: For example, the four great oceans might dry up, but this food would never be exhausted.

source: ཚུལ་ཁྲིམས་དང་། ཤེས་རབ་དང་། ཏིང་ངེ་འཛིན་མི་ཟད་པ་ལས་བྱུང་བ་དེ་བཞིན་གཤེགས་པའི་ཞལ་ཟས་སྣོད་དུ་ལུས་པ་འདི་ཟད་པར་མི་ནུས་སོ།
en: Issued from inexhaustible morality, concentration, and wisdom, the remains of the food of the Tathāgata contained in this vessel cannot be exhausted.

source: སྐྱེས་བུ་དམ་པ་རྣམས་སེམས་ཅན་འདི་དག་ནི་གདུལ་དཀའ་སྟེ།
en: Good sirs, these living beings here are hard to discipline.

source: །འདི་ནི་སེར་སྣའོ། །འདི་ནི་སེར་སྣའི་འབྲས་བུའོ།
en: This is miserliness, and this is its effect.

source: །འདི་ནི་ཀུན་ནས་ཉོན་མོངས་པའོ། །འདི་ནི་རྣམ་པར་བྱང་བའོ།
en: This is affliction and that is purification.

source: །འདི་ནི་འཁོར་བའོ། །འདི་ནི་མྱ་ངན་ལས་འདས་པའོ་
en: This is life and that is liberation.

source: ཞེས་དེ་ལྟ་བུར་ཆོས་རྣམ་པ་དུ་མར་བཤད་པས་རྟ་དམུ་རྒོད་ལྟ་བུའི་སེམས་རབ་ཏུ་གནས་པར་བྱེད་དོ།
en: Thus, by means of these varied explanations of the Dharma, the Buddha trains the minds of those living beings who are just like wild horses.

source: འདི་ལྟར་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་སངས་རྒྱས་ཀྱི་ཆེ་བ་བཞག་སྟེ།
en: Thus is established the greatness of the Buddha Śākyamuni!

source: ངན་ཅིང་དབུལ་བ་སེམས་ཅན་དམུ་རྒོད་རྣམས་འདུལ་བ་
en: he civilizes the wild living beings who are poor and inferior.

source: སྐྱེས་བུ་དམ་པ་དག་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིར་གང་དེ་དག་ཡོངས་སུ་འཛིན་པར་འགྱུར་བའི་དགེ་བ་བསགས་པ་ཆོས་བཅུ་ཡོད་དེ། དེ་དག་ནི་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་ན་མེད་དོ།
en: Good sirs, in this Sahā universe, there are ten virtuous practices that do not exist in any other buddhafield.

source: །འཇམ་དཔལ་སེམས་ཅན་ཆེན་པོ་འདི་དག་ཀྱང་དེ་བཞིན་གཤེགས་པ་མཐོང་ཞིང་ཕྱག་འཚལ་བར་འགྱུར་གྱིས་ཡུ་བུ་ཅག་བཅོམ་ལྡན་འདས་ཀྱི་དྲུང་དུ་འདོང་ངོ་།
en: Mañjuśrī, let us take these many living beings into the presence of the Lord, so that they may see the Tathāgata and bow down to him!

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The Buddha said to Śāriputra,

source: །ཤཱ་རིའི་བུ་ཁྱོད་ཀྱིས་སེམས་ཅན་གྱི་མཆོག་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་མཐོང་ངམ།
en: Śāriputra, did you see the miraculous performances of the bodhisattvas, those best of beings?

source: དེ་ལ་ཁྱོད་ཀྱི་འདུ་ཤེས་ཇི་ལྟ་བུར་སྐྱེས།
en: What concept did you produce toward them?

source: བཅོམ་ལྡན་འདས་བདག་དེ་ལ་བསམ་གྱིས་མི་ཁྱབ་པའི་འདུ་ཤེས་སྐྱེས་ལགས་སོ།
en: Lord, I produced the concept of inconceivability toward them.

source: །ཇི་ལྟར་བསམ་པ་དང་། གཞལ་བ་དང་། བགྲང་བར་མི་ནུས་པ་དེ་ལྟ་བུར་དེ་དག་གི་བགྱིད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་མཐོང་ངོ་།
en: Their activities appeared inconceivable to me to the point that I was unable to think of them, to judge them, or even to imagine them.

source: དྲི་ཅི་ལས་བྱུང་སྨྲས་པ།
en: Where does the perfume come from?

source: ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་འདིས་དེ་བཞིན་གཤེགས་པ་སྤོས་མཆོག་བརྩེགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་སྤོས་ཐམས་ཅད་ཀྱི་དྲི་མཆོག་ནས་ཞལ་ཟས་བླངས་ཏེ། ཟོས་སོ་ཅོག་ཐམས་ཅད་ཀྱི་ལུས་ལས་འདི་ལྟ་བུའི་དྲི་བྱུང་ངོ་།
en: The Licchavi Vimalakīrti obtained some food from the universe called Sarva­gandha­sugandhā, the buddhafield of the Tathāgata Gandhottama­kūṭa, and this perfume emanates from the bodies of all those who partook of that food.

source: ཇི་སྲིད་ཟས་མ་ཞུ་བའི་བར་དུའོ།
en: Until it is digested.

source: དེ་ཡུན་ཇི་སྲིད་ན་ཞུ་བར་གྱུར།
en: When will it be digested?

source: ཞག་བདུན་ཕྲག་བདུན་གྱིས་ཞུ་བར་འགྱུར་ཏེ།
en: It will be digested in forty-nine days,

source: །དེ་བཞིན་དུ་བཙུན་པ་ཀུན་དགའ་བོ་
en: Similarly, reverend Ānanda,

source: ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱི་དུག་མེད་པར་མ་གྱུར་གྱི་བར་དུ་ཟས་དེ་འཇུ་བར་མི་འགྱུར་ཏེ། ཟས་དེ་ཕྱིས་གདོད་འཇུ་བར་འགྱུར་རོ།
en: this food is not digested until all the poisons of the passions have been eliminated—only then is it digested.

source: །ཀུན་དགའ་བོ་གང་དག་ན་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་མཛད་པ་བྱེད་པའི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་ཀྱང་ཡོད་དོ། །གང་དག་ན་འོད་ཀྱིས་སངས་རྒྱས་ཀྱི་མཛད་པ་བྱེད་པའི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་ཀྱང་ཡོད་དོ། །གང་དག་ན་བྱང་ཆུབ་ཀྱི་ཤིང་གིས་སངས་རྒྱས་ཀྱི་མཛད་པ་བྱེད་པའི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་ཀྱང་ཡོད་དོ། །གང་དག་ན་དེ་བཞིན་གཤེགས་པའི་མཚན་དང་གཟུགས་མཐོང་བས་སངས་རྒྱས་ཀྱི་མཛད་པ་བྱེད་པའི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་ཀྱང་ཡོད་དོ། །གང་དག་ན་ཆོས་གོས་ཀྱིས་སངས་རྒྱས་ཀྱི་མཛད་པ་བྱེད་པའི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་ཀྱང་ཡོད་དོ། །དེ་བཞིན་དུ་ཞལ་ཟས་ཀྱིས་སངས་རྒྱས་ཀྱི་མཛད་པ་བྱེད་པ་དང་། དེ་བཞིན་དུ་ཆུ་དང་། སྐྱེད་མོས་ཚལ་དང་། གཞལ་མེད་ཁང་དང་། ཁང་པ་བརྩེགས་པས་སངས་རྒྱས་ཀྱི་མཛད་པ་བྱེད་པ་དག་ཀྱང་ཡོད་དོ། །ཀུན་དགའ་བོ་གང་དག་ན་སྤྲུལ་པས་སངས་རྒྱས་ཀྱི་མཛད་པ་བྱེད་པའི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་ཀྱང་ཡོད་དོ། །ཀུན་དགའ་བོ་ནམ་མཁས་སངས་རྒྱས་ཀྱི་མཛད་པ་བྱེད་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དག་ཀྱང་ཡོད་དོ། །དེ་བཞིན་དུ་ནམ་མཁའ་དང་བར་སྣང་དག་སངས་རྒྱས་ཀྱི་མཛད་པ་བྱེད་དེ། དེ་ལྟ་བུས་སེམས་ཅན་དེ་དག་འདུལ་བར་འགྱུར་རོ།
en: Ānanda! There are buddhafields that accomplish the buddha-work by means of bodhisattvas, those that do so by means of lights, those that do so by means of the tree of enlightenment, those that do so by means of the physical beauty and the marks of the Tathāgata, those that do so by means of religious robes, those that do so by means of food, those that do so by means of water, those that do so by means of gardens, those that do so by means of palaces, those that do so by means of mansions, those that do so by means of magical incarnations, those that do so by means of empty space, and those that do so by means of lights in the sky. Why is it so, Ānanda? Because by these various means, living beings become disciplined.

source: །ཀུན་དགའ་བོ་དེ་བཞིན་དུ་
en: Similarly, Ānanda,

source: རྨི་ལམ་དང་། གཟུགས་བརྙན་དང་། ཆུ་ཟླ་དང་། བྲག་ཅ་དང་། སྒྱུ་མ་དང་། སྨིག་རྒྱུ་དང་། དཔེར་བསྟན་པ་དང་། ཡི་གེ་དང་། ངེས་པའི་ཚིག་སྟོན་པ་སེམས་ཅན་དེ་དག་ལ་སངས་རྒྱས་ཀྱི་མཛད་པ་བྱེད་པ་དག་ཀྱང་ཡོད་དོ།
en: there are buddhafields that accomplish the buddha-work by means of teaching living beings words, definitions, and analogies, such as ‘dreams,’ ‘images,’ the ‘reflection of the moon in water,’ ‘echoes,’ ‘illusions,’ and ‘mirages’;

source: །གང་དག་ན་ཡི་གེ་རྣམ་པར་རིག་པར་བྱེད་པས་སངས་རྒྱས་ཀྱི་མཛད་པ་བྱེད་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དག་ཀྱང་ཡོད་དོ།
en: and there are those that accomplish the buddha-work by making words understandable.

source: །ཀུན་དགའ་བོ་གང་ན་སྨྲ་བ་མེད་པ་དང་། བརྗོད་པ་མེད་པ་དང་། མི་བསྟན་པ་དང་། མི་བརྗོད་པས་སེམས་ཅན་དེ་དག་ལ་སངས་རྒྱས་ཀྱི་མཛད་པ་བྱེད་དེ། དེ་ལྟ་བུར་ཡོངས་སུ་དག་པའི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་ཀྱང་ཡོད་དོ།
en: Also, Ānanda, there are utterly pure buddhafields that accomplish the buddha-work for living beings without speech, by silence, inexpressibility, and unteachability.

source: །ཀུན་དགའ་བོ་བདུད་བཞི་པོ་དེ་དག་དང་། ཉོན་མོངས་པའི་སྒོ་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞིས་སེམས་ཅན་རྣམས་ཀུན་ནས་ཉོན་མོངས་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་སངས་རྒྱས་ཀྱི་མཛད་པ་བྱེད་དོ།
en: Finally, Ānanda, the buddhas accomplish the buddha-work by means of the four māras and all the eighty-four thousand types of passion that afflict living beings.

source: ཡོངས་སུ་སྤྱོད་པས་སེམས་ཅན་རྣམས་འདུལ་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་མཛད་པ་མི་བྱེད་པ་ནི་གང་ཡང་མེད་དོ།
en: there are none that do not accomplish the buddha-work, because all discipline living beings.

source: ཆོས་ཀྱི་སྒོ་འདིར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་
en: The bodhisattva who enters this Dharma-door

source: ཡོན་ཏན་རྒྱ་ཆེན་པོ་བཀོད་པ་ཐམས་ཅད་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་ལ་
en: when confronted by a buddhafield adorned with the splendor of all noble qualities,

source: །ཀུན་དགའ་བོ་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་གཟུགས་དང་། ཁ་དོག་དང་། གཟི་བརྗིད་དང་། སྐུ་དང་། མཚན་དང་། རིགས་བཙུན་པ་དང་། ཚུལ་ཁྲིམས་དང་། ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་དང་། རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་དང་། སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། ཕན་པར་དགོངས་པ་དང་། སྤྱོད་ལམ་དང་། སྤྱོད་པ་དང་། ལམ་དང་། ཚེའི་ཚད་དང་། ཆོས་སྟོན་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དང་། སེམས་ཅན་རྣམ་པར་གྲོལ་བ་དང་། ཞིང་ཡོངས་སུ་དག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་མཚུངས་ཏེ།
en: Ānanda, all the buddhas are the same as to the perfection of their buddha-qualities: that is, their forms, their colors, their radiance, their bodies, their marks, their nobility, their morality, their concentration, their wisdom, their liberation, their gnosis and vision of liberation, their strengths, their fearlessnesses, their special buddha-qualities, their great love, their great compassion, their helpful intentions, their attitudes, their practices, their paths, the lengths of their lives, their teachings of the Dharma, their development and liberation of living beings, and their purification of buddhafields.

source: དེ་བས་ན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཞེས་བྱའོ། །དེ་བཞིན་གཤེགས་པ་ཞེས་བྱའོ། །སངས་རྒྱས་ཞེས་བྱའོ།
en: Therefore, they are all called ‘saṃyaksaṃbuddhas,’ ‘tathāgatas,’ and ‘buddhas.’

source: །སྟོང་གསུམ་དུ་གཏོགས་པའི་སེམས་ཅན་རྣམས་ཀུན་དགའ་བོ་ཁྱོད་འདྲ་བར་མང་དུ་ཐོས་པ་དང་། དྲན་པ་དང་། གཟུངས་ཐོབ་པ་རྣམས་ཀྱི་ནང་ན་མཆོག་ཏུ་གྱུར་ལ།
en: Also, Ānanda, if all the living beings of this billion-world galactic universe were like you—the foremost of the learned and the foremost of those endowed with memory and incantations—

source: དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བ་དང་། སངས་རྒྱས་ཞེས་བྱ་བའི་ཚིག་དེ་གསུམ་གྱི་དོན་གདོན་མི་ཟ་བར་བསྟན་པ་ནི་བསྐལ་པར་ཡང་ཀུན་ཆུབ་པར་མི་ནུས་སོ།
en: and were they to devote an entire eon, they would still be unable to understand completely the exact and extensive meaning of the three words ‘saṃyaksaṃbuddha,’ ‘tathāgata,’ and ‘buddha.’

source: ཀུན་དགའ་བོ་ཁྱོད་ཉན་ཐོས་རྣམས་ལ་དགོངས་ཏེ་མང་དུ་ཐོས་པའི་མཆོག་གོ་ཞེས་ངས་བསྟན་གྱི་བྱང་ཆུབ་སེམས་དཔའི་ནང་ན་ནི་མ་ཡིན་ནོ།
en: I pronounced you, Ānanda, the foremost of the learned, with the disciples in mind, not considering the bodhisattvas.

source: ཀུན་དགའ་བོ་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་གཏིང་ནི་ཚད་གཟུང་བར་ནུས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཤེས་རབ་དང་། ཡེ་ཤེས་དང་། དྲན་པ་དང་། གཟུངས་དང་། སྤོབས་པའི་གཏིང་ནི་ཚོད་གཟུང་མི་ནུས་སོ།
en: Ānanda, one can fathom the depths of the ocean, but one cannot fathom the depths of the wisdom, gnosis, memory, incantations, or eloquence of the bodhisattvas.

source: ཀུན་དགའ་བོ་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་འདིས་སྔ་དྲོ་གཅིག་ལ་བཀོད་པ་བསྟན་པ་ནི་
en: Ānanda, these marvels displayed in a single morning by the Licchavi Vimalakīrti
